TEXT = {'start': "👋 Привет! Я бот для реставрации фотографий\n\n"
        "📸 Отправь мне старую или поврежденную фотографию, "
        "и я попробую её восстановить!\n\n"
        "✨ Я могу:\n"
        "• Убрать царапины и шум\n"
        "• Улучшить качество и резкость\n"
        "• Восстановить повреждённые участки\n"
        "• Улучшить цвета и контраст\n\n"
        "Просто пришли фото, и я начну работу!\n\n"
        "<i>Первая генерация <b>БЕСПЛАТНО!</b></i>",
        "photo_accepted": "🪄 Восстанавливаю фото, это не займет много времени...",
        "generation_error": "Ошибка при обработке изображения.\nМы добавили вам 1 бесплатную генерацию\nПопробуйте снова отправить фотографию",
        "payment": {"label": "Восстановить фото",
                    "title": "Восстановить фото",
                    "description": "✨ Восстановите старую или повреждённую фотографию!\n"
                    "После оплаты я верну ей чёткость, цвет и жизнь",
                    "payment_accepted": "Платеж принят ✅\n🪄 Восстанавливаю фото, это не займет много времени..."},
        "photo_is_ready": "✨ Готово! Фото восстановлено"
        }

BUTTONS_TEXT = {'pay': "Оплатить ⭐ {amount}"}